<template>
  <div class="mt-20 overflow-x-hidden">
    <div class="max-w-container px-4 mx-auto">
      <div class="text-base font-light font-primary text-primary">
        <h1 class="text-4xlg font-medium mb-6">
          Разработка программных комплексов для управления автопарками
          состоящими из электромобилей
        </h1>
        <div class="flex flex-col laptop:flex-row mb-4">
          <div class="mb-20 laptop:mb-0">
            <p class="indent-6 mb-4">
              Наша компания – инновационный разработчик программных комплексов,
              специализирующихся на управлении автопарками, включающими в себя
              электромобили. Мы считаем, что будущее автомобильной индустрии
              принадлежит электрическим транспортным средствам, и поэтому наша
              миссия заключается в предоставлении клиентам эффективных и
              интеллектуальных решений для управления и оптимизации их
              электромобильных парков.
            </p>
            <ul class="list-disc [&>li]:ml-6">
              <p>Основной функционал разрабатываемого комплекса:</p>
              <li>
                Наши программные продукты предоставляют комплексные решения для
                мониторинга и управления каждым электромобилем в автопарке.
                Отслеживание местоположения, состояния заряда, технического
                обслуживания и другие аспекты флота осуществляются в режиме
                реального времени.
              </li>
              <li>
                Мы разрабатываем интеллектуальные алгоритмы для оптимизации
                маршрутов электромобилей, учитывая факторы, такие как трафик,
                наличие зарядных станций и индивидуальные предпочтения клиентов.
                Это способствует уменьшению времени в пути, повышению
                эффективности и снижению эксплуатационных расходов.
              </li>
              <li>
                Наши продукты позволяют эффективно управлять энергопотреблением
                электромобилей. Мы предоставляем инструменты для мониторинга
                зарядки, распределения энергии и оптимизации времени подключения
                к зарядным станциям.
              </li>
              <li>
                Наш аналитический инструментарий предоставляет клиентам глубокий
                анализ данных о деятельности и производительности флота. Это
                помогает принимать информированные решения, улучшать процессы и
                повышать эффективность использования электромобилей.
              </li>
            </ul>
            <p class="indent-6 mt-4">
              Такой подход позволяет клиентам сосредоточиться на своих
              бизнес-целях и экономить время и ресурсы на управление
              автопарками.
            </p>
          </div>
          <img
            class="self-center relative bottom-20 float-right max-w-[16rem] laptop:max-w-md laptop:ml-20"
            src="~/assets/svg/services-pages/developing_big.svg"
            alt="developing"
          />
        </div>
      </div>
    </div>
    <NuxtLink to="../contacts">
      <button
        class="w-screen py-8 mx-auto font-primary text-2xl tablet:text-3xlg font-medium text-primary bg-button hover:shadow-xl active:shadow-buttonActive active:translate-y-[3px]"
      >
        Получить консультацию по услуге
      </button>
    </NuxtLink>
  </div>
</template>

<script setup>
useHead({
  title: 'Разработка ПО для управления автопарком из электромобилей',
  meta: [
    {
      name: 'description',
      content:
        'Разработка программных комплексов для управления автопарками состоящими из электромобилей'
    },
    { name: 'robots', content: 'noindex' }
  ]
});
</script>
